Функция НайтиПоАртикулу(Артикул) Экспорт    РезультатПроверки = ПроверкиFoodFactory.ПроверитьАртикул(Артикул);
	
	Если Не РезультатПроверки.Корректен Тогда
		ВызватьИсключение РезультатПроверки.Сообщение;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", РезультатПроверки.НормализованныйАртикул);
	КонецФункции  

Функция ПроверитьУникальностьАртикула(Артикул, Ссылка) Экспорт
    НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоАртикулу(Артикул);                                       
	Результат = Новый Структура;
	Если НайденнаяНоменклатура.Пустая() Тогда
		Результат.Вставить("Свободен", Истина);
		Результат.Вставить("Сообщение", "Артикул свободен");
		Возврат Результат; 
	ИначеЕсли НайденнаяНоменклатура = Ссылка Тогда
		Результат.Вставить("Свободен", Истина);		
		Результат.Вставить("Сообщение", "Артикул свободен");
		Возврат Результат;		
	Иначе
		Результат.Вставить("Свободен", Ложь);		
		Результат.Вставить("Сообщение", "Артикул уже используется");
		Возврат Результат;
	КонецЕсли;
КонецФункции